Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: འདུས་མ་བྱས་ཀྱི་དབྱིངས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན། འདུས་བྱས་ཀྱི་ཁམས་འདོར་བར་བྱེད་པ་མ་ཡིན།
en: It does not attain the unconditioned expanse and it does not reject conditioned elements.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་བར་དུ་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན།
en: It does not attain the perfection of generosity, and it does not attain [the other perfections], up to and including the perfection of meditative concentration.

source: ནང་སྟོང་པ་ཉིད་ཉེ་པར་སྒྲུབ་པ་མ་ཡིན།
en: It does not attain the emptiness of internal phenomena.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན།
en: It does not attain [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན། ཡང་དག་པར་སྤོང་བ་དང་།
en: It does not attain the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: It does not attain the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན།
en: It does not attain the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན་ནོ། །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: It does not attain [the fruits and realizations], up to and including all-aspect omniscience.” “

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ།
en: Venerable Śāradvatiputa, it is so!

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་གིས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི།
en: replied Śakra. “

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན། སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་འདོར་བར་བྱེད་པ་མ་ཡིན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བར་ཤེས་པ་དེ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྒོམ་པ་ཡིན་ནོ།
en: One who knows that the perfection of wisdom does not attain the attributes of the buddhas, does not reject the attributes of ordinary persons, and does not attain [the fruits and realizations], up to and including all-aspect omniscience, engages in the perfection of wisdom and cultivates the perfection of wisdom.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཉིས་སུ་ཤེས་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: The perfection of wisdom is not known in duality.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མི་གཉིས་པའོ།
en: The perfection of wisdom is nondual.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཉིས་སུ་ཤེས་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are not known in duality.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མི་གཉིས་པའོ།
en: The perfection of generosity [and so forth] are nondual.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་གནང་སྟེ།
en: Then the Blessed One applauded Śakra, mighty lord of the gods: “Kauśika, that is excellent!

source: ཀཽ་ཤི་ཀ་ལེགས་སོ་ལེགས་སོ།
en: That is excellent!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མི་གཉིས་པའོ།
en: If you ask why, the perfection of wisdom is nondual.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མི་གཉིས་པའོ།
en: If you ask why, the perfection of generosity [and so forth] are nondual. “

source: །ཀཽ་ཤི་ཀ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གཉིས་སུ་འདོད་པ་དེ་ནི། ཆོས་ཀྱི་དབྱིངས་ལ་གཉིས་སུ་འདོད་དུ་ཟད་དོ།
en: Kauśika, those who hold that the perfection of wisdom is duality simply hold that the realm of phenomena is duality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཆོས་ཀྱི་དབྱིངས་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: If you ask why, Kauśika, it is because the realm of phenomena and the perfection of wisdom are not two things, and are not to be divided into two. {

source: །ཀཽ་ཤི་ཀ་གང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Ki.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གཉིས་སུ་འདོད་པ་དེ་ནི། ཆོས་ཀྱི་དབྱིངས་ལ་གཉིས་སུ་འདོད་དུ་ཟད་དོ།
en: II-III: 89} Kauśika, those who hold that the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are duality simply hold that the realm of phenomena is duality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་ཀྱི་དབྱིངས་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: If you ask why, Kauśika, it is because the realm of phenomena and the perfection of generosity [and so forth] are not two things, and are not to be divided into two. “

source: །ཀཽ་ཤི་ཀ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གཉིས་སུ་འདོད་པ་དེ་ནི། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལ་གཉིས་སུ་འདོད་དུ་ཟད་དོ།
en: Kauśika, those who hold that the perfection of wisdom is duality simply hold that the real nature, the very limit of reality, and the inconceivable realm are duality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཀཽ་ཤི་ཀ་གང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: If you ask why, Kauśika, it is because the real nature, the very limit of reality, the inconceivable realm, and the perfection of wisdom are not two things, and are not to be divided into two.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གཉིས་སུ་འདོད་པ་དེ་ནི། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ལ་གཉིས་སུ་འདོད་དུ་ཟད་དོ།
en: Kauśika, those who hold that the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are duality simply hold that the real nature, the very limit of reality, and the inconceivable realm are duality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: If you ask why, Kauśika, it is because the real nature, the very limit of reality, the inconceivable realm, and the perfection of generosity [and so forth] are not two things, and are not to be divided into two.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བགྱི་བར་འོས་པ་སྟེ།
en: Then Śakra, mighty lord of the gods, said to the Blessed One, “Blessed Lord, this perfection of wisdom is worthy of homage by the world with its gods, humans, and asuras.

source: དེ་ལ་བསླབས་པས་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Having trained in it, bodhisattva great beings have attained, are attaining, and will attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་ཆོས་བཟང་པོའི་ལྷའི་འཁོར་དུ་བདག་ཉིད་ཀྱི། ལྷའི་དབང་པོའི་སྟན་ལ་མཆིས་པར་གྱུར་པ་དེའི་ཚེ། དེར་ལྷའི་བུ་གང་ཇི་སྙེད་ཅིག་བདག་གི་རིམ་གྲོ་ལ་མཆིས་པ་དེ་དག་ཀུན་ཀྱང་བདག་ལ་མཆོད་པ་བགྱིད་དེ། ནམ་དེར་བ་དག་མ་མཆིས་ཤིང་། སྟན་དེ་ལ་མ་མཆིས་པ་དེའི་ཚེ་ཡང་ལྷའི་བུ་དེ་དག་འཁོར་དེར་མཆིས་ཤིང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སྟན་འདི་ལ་འདུག་ཅིང་།
en: Blessed Lord, when I am seated on my seat, which is that of the mighty lord of the gods, in the divine assembly of Sudharmā, all the gods who are in my service do indeed worship me, but when I am not there and when I am not seated on that seat, those gods remain within that assembly and from the right they circumambulate that seat, which is said to be the one on which Śakra, mighty lord of the gods, is seated when he teaches the Dharma to the gods of Trayastriṃśa.

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་ཏོ་ཞེས་སྟན་དེ་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བ་བགྱིས་ཅིང་ཕྱག་འཚལ་ཏེ་སླར་མཆིའོ།
en: After paying homage to it, they then depart again [for their own abodes].

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཆད་བ་དང་། ཁ་ཏོན་དུ་བགྱིད་ཅིང་གཞན་ལ་ཡང་རྒྱ་ཆེར་སྟོན་པ་དེར། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཇི་སྙེད་ཅིག་མཆིས་པ་དེ་དག་ཀྱང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་འདི་ལས་བྱུང་ངོ་། །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་འདི་ལས་བྱུང་ངོ་། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་འདི་ལས་བྱུང་ངོ་ཞེས།
en: Blessed Lord, in the same way, all the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas in the world systems of the ten directions who come to that place where this perfection of wisdom has been committed to writing, and where it is taken up, upheld, recited, and extensively taught to others, will indeed recall that the tathāgatas, arhats, completely awakened buddhas have originated from it, that all the śrāvakas and pratyekabuddhas have also originated from it, and that even all the everyday necessities of all beings have originated from it.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཕྱག་བགྱིས་ཤིང་གདུང་བ་བགྱིས་ནས་སླར་མཆི་བར་འགྱུར་རོ།
en: Paying homage to the perfection of wisdom, they will fervently return [to their own abodes].

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་མཆོད་པ་མངའ་བ་ཡང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་བསྒྲུབས་པའི་སླད་དུ། མཆོད་པ་མངའ་སྟེ།
en: Even though the bone relics of the tathāgatas are presented with offerings, they are presented with offerings because they have been consummated through the perfection of wisdom.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་གཞིར་གྱུར་ཏོ། །རྒྱུར་གྱུར་ཏོ།
en: If one were to ask why, Blessed Lord, when bodhisattva great beings practice the conduct of a bodhisattva, the perfection of wisdom is the ground of the wisdom of all-aspect omniscience.

source: །རྐྱེན་དུ་གྱུར་ཏོ།
en: It becomes its primary cause, it becomes its secondary condition, and it becomes its consummation.

source: །ཡོངས་སུ་སྒྲུབ་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་ཆ་དེ་གཉིས་ལས་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལེན་ཏོ།
en: Therefore, Blessed Lord, among those two [aforementioned] choices, I would take this perfection of wisdom. “

source: །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བླངས་ཏེ། ཆོས་ཀྱི་ཁོངས་སུ་གཏོགས་པའི་ཡིད་ཀྱིས་ཁ་ཏོན་བགྱིད་པ་དེའི་ཚེ་འཇིགས་པའམ། བག་ཚ་བའི་མཚན་མ་ཙམ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Blessed Lord, when I have trained in this perfection of wisdom, and when I recite it with a mind permeated by the Dharma, {Ki.II-III: 90} I do not observe even a mere sign of fear or trepidation.

source: །བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མཚན་མ་མ་མཆིས། རྟགས་མ་མཆིས་བརྗོད་དུ་མ་མཆིས་པ་སྟེ།
en: Blessed Lord, if one were to ask why, the perfection of wisdom is without signs, without indications, and inexpressible.

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྨོས་སུ་མ་མཆིས་པའོ།
en: Blessed Lord, the perfection of wisdom cannot be spoken.

source: །བཅོམ་ལྡན་འདས་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མཚན་མ་མ་མཆིས་རྟགས་མ་མཆིས་བརྗོད་དུ་མ་མཆིས་པ་སྟེ།
en: Blessed Lord, the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are without signs, without indications, and inexpressible.

source: བཅོམ་ལྡན་འདས་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་དག་ནི་སྨོས་སུ་མ་མཆིས་པའོ།
en: Blessed Lord, those perfections cannot be spoken.

source: །བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་མཚན་མ་མ་མཆིས། རྟགས་མ་མཆིས་བརྗོད་དུ་མ་མཆིས་པ་སྟེ།
en: Blessed Lord, [the attributes, fruits, and realizations], up to and including all-aspect omniscience, are without signs, without indications, and inexpressible.

source: བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་སྨོས་སུ་མ་མཆིས་པའོ།
en: Blessed Lord, all-aspect omniscience [and so forth] cannot be spoken.

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཚན་མ་མ་མཆིས་པ་ཞིག་ལགས་ཏེ། མཚན་མ་མ་མཆིས་པ་མ་ལགས་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཆོས་ཐམས་ཅད་ལ་མཚན་མ་མ་མཆིས་པ་དང་། རྟགས་མ་མཆིས་པ་དང་། བརྗོད་དུ་མ་མཆིས་པ་དང་། སྨོས་སུ་མ་མཆིས་པར་ཐུགས་སུ་ཆུད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་མཚན་མ་མ་མཆིས་པ་དང་། རྟགས་མ་མཆིས་པ་དང་། བརྗོད་དུ་མ་མཆིས་པ་དང་། སྨོས་སུ་མ་མཆིས་པའི་ཆོས་མི་སྟོན་ཏོ།
en: Blessed Lord, if the perfection of wisdom, which is without signs, were not signless, the tathāgatas, arhats, completely awakened buddhas, after comprehending that all phenomena are without signs, without indications, inexpressible, and indescribable, and after attaining consummate buddhahood in unsurpassed, complete enlightenment, would not teach beings the Dharma that is without signs, without indications, inexpressible, and indescribable.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཚན་མ་མ་མཆིས། རྟགས་མ་མཆིས། བརྗོད་དུ་མ་མཆིས། སྨོས་སུ་མ་མཆིས་པས། དེའི་སླད་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཚན་མ་མ་མཆིས་པ་དང་། རྟགས་མ་མཆིས་པ་དང་། བརྗོད་དུ་མ་མཆིས་པ་དང་། སྨོས་སུ་མ་མཆིས་པར་ཐུགས་སུ་ཆུད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་མཚན་མ་མ་མཆིས་པ་དང་། རྟགས་མ་མཆིས་པ་དང་། བརྗོད་དུ་མ་མཆིས་པ་དང་། སྨོས་སུ་མ་མཆིས་པའི་ཆོས་བསྟན་ཏོ།
en: Blessed Lord, since the perfection of wisdom is without signs, without indications, inexpressible and indescribable, for that reason they comprehend that all phenomena are without signs, without indications, inexpressible, and indescribable, and after attaining consummate buddhahood in unsurpassed, complete enlightenment, they do teach beings the Dharma that is without signs, without indications, inexpressible, and indescribable. “

source: །བཅོམ་ལྡན་འདས་དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: So it is, Blessed Lord, that this perfection of wisdom is worthy of being honored, respected, and venerated by the world with its gods, humans, and asuras and it is worthy of being presented with offerings, that is to say with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds.

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པར་བགྱི་བར་འོས་པའོ། །བྲིས་ཤིང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པར་བགྱི་བར་འོས་པའོ། །བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་། འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དང་། དེ་བྲིས་ཤིང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་
en: Committed to writing, it will be worthy of being honored, respected, and venerated by the world with its gods, humans, and asuras and it is worthy of being presented with offerings, that is to say with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds. “

source: བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་གྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བགྱིད་པ་དེ་ནི་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་དེས་སེམས་ཅན་དམྱལ་བའི་རྒྱུད་ཀྱི་དོགས་པ་མ་མཆིས་པར་བགྱིའོ།
en: Blessed Lord, anyone who takes up, upholds, recites, masters, and focuses their attention correctly on this perfection of wisdom, and who commits it to writing and then honors, respects, venerates, and makes offerings to it with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds should not harbor doubts, thinking that, until they have attained consummate buddhahood in unsurpassed, complete enlightenment, they might be reborn among the denizens of the hells.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་རྒྱུད་ཀྱི་དོགས་པ་མ་མཆིས་པར་བགྱིའོ།
en: They should not harbor doubts, thinking that they might be reborn in the animal realm or in the world of Yama.

source: །ཉན་ཐོས་ཀྱི་ས་དང་རང་སངས་རྒྱས་ཀྱི་སའི་དོགས་པ་མ་མཆིས་པར་བགྱིའོ།
en: They should not harbor doubts, thinking that they might remain on the level of the śrāvakas or the level of the pratyekabuddhas.

source: །དེ་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་ཡང་མི་འབྲལ་བར་འགྱུར།
en: For they will behold the tathāgatas and never be separated from them.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་ཡང་མི་འབྲལ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་
en: They will never be separated from acts that bring beings to maturation.

source: བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པར་བགྱིད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འཆི་པར་འགྱུར་རོ།
en: Traveling from buddhafield to buddhafield, they will serve, respect, honor, and worship those tathāgatas, arhats, completely awakened buddhas with flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་བྱུར་བུར་གཏམས་པ་ཞིག་ཀྱང་སྩལ་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡང་བྲིས་ཏེ་སྩལ་ན། བཅོམ་ལྡན་འདས་དཀོན་མཆོག་དེ་གཉིས་ལས་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལེན་ཏོ།
en: Moreover, Blessed Lord, if I were presented with this great trichiliocosm, filled to the brim with the bone relics of the tathāgatas, and if I were presented with this perfection of wisdom, committed to writing, then, Blessed Lord, of these two precious things I would take this perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལས་བྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ཏེ།
en: If one were to ask why, Blessed Lord, the tathāgatas and the bone relics of the tathāgatas have originated from it.

source: དེ་བས་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཀྱང་རིམ་གྲོར་བགྱི་བ་དང་། བཀུར་སྟིར་བགྱི་བ་དང་། བསྟི་སྟང་དུ་བགྱི་ཞིང་མཆོད་པར་བགྱི་བ་ལགས་ཏེ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས། དེ་དག་ལ་རིམ་གྲོར་བགྱིས།
en: It is for that reason that those bone relics of the tathāgatas should be honored, respected, venerated, and presented with offerings.

source: བཀུར་སྟིར་བགྱིས། བསྟི་སྟང་དུ་བགྱིས། མཆོད་པར་བགྱིས་ན། ལོག་པར་ལྟུང་བ་དང་། ངན་སོང་དུ་མཆི་བར་མི་འགྱུར་ཏེ།
en: If those noble sons or noble daughters serve, respect, honor, and worship them, they will not lapse into error and they will not proceed into lower realms.

source: ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་མྱོང་ནས། སྨོན་ལམ་གྱི་ཚུལ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཐེག་པའམ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་རོ།
en: After experiencing the excellence of gods and humans, they will attain final nirvāṇa by means of the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, or the vehicle of the completely awakened buddhas, in accordance with their aspiration. {

source: །བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་གང་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བྲིས་པ་མཐོང་བ་དེ་ནི་མི་འདྲ་བ་མ་མཆིས་སོ།
en: Ki.II-III: 91} “Blessed Lord, for that reason the vision of the tathāgatas and the vision of the perfection of wisdom that has been committed to writing are not dissimilar.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་གཉིས་སུ་མ་མཆིས་ཏེ་གཉིས་སུ་བགྱིར་མ་མཆིས་སོ།
en: If one were to ask why, Blessed Lord, it is because the perfection of wisdom and the tathāgatas are not two things, and are not to be divided into two. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་གང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཆོ་འཕྲུལ་རྣམ་པ་གསུམ་ལ་བཞུགས་ཏེ། མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཆོས་གཏན་ལ་དབབ་པ་བསྟན་པའི་བར་དུ་གསུངས་ཏེ་བཤད་པ་དང་། རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ལ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བཟུང་ཞིང་ཀུན་ཆུབ་པར་བགྱིས་ཏེ། གཞན་ལ་བསྟན་པ་དེ་གཉིས་ཀྱང་མི་འདྲ་བ་མ་མཆིས་སོ།
en: Moreover, Blessed Lord, there is no difference at all between the tathāgatas, arhats, completely awakened buddhas who enter into the three miracles, and consequently explain the [twelve branches of the scriptures]—the discourses, the sayings in prose and verse, the prophetic declarations and so on, up to and including the established instructions—and any noble sons or noble daughters who take up and master this perfection of wisdom, and then teach it to others.

source: །བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལས་བྱུང་བ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སོ།
en: If one were to ask why, Blessed Lord, the tathāgatas, arhats, completely awakened buddhas have originated from this [perfection of wisdom].

source: །འདི་ལས་བྱུང་བ་ནི་ཆོ་འཕྲུལ་རྣམ་པ་གསུམ་མོ། །འདི་ལས་བྱུང་བ་ནི་མདོ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་དང་།
en: The three miracles have originated from it.

source: ལུང་བསྟན་པ་དང་། ཆོས་གཏན་ལ་དབབ་པ་བསྟན་པའི་བར་དག་གོ། །བཅོམ་ལྡན་འདས་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་མང་པོ་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་།
en: The discourses, the sayings in prose and verse, the prophetic declarations, and so on, up to and including the established instructions, have originated from it. “
